
/**
 * Created by zhoupan on 9/23/15.
 */
import javax.swing.JOptionPane;
public class Guess_Lastname{
    public static void main(String[] args){
        int[] sign=new int[]{-1,-1};
        int k=0;
        String[][] check_1= new String[24][];
        String[][] check_2= new String[15][];
        check_1[0]=new String[]{"Íõ      ","Àî      ","ÕÅ\n","Áõ      ","³Â      ","Ñî\n","ÖÜ      ","»Æ      ","Ëï\n","Îâ      ","Ðì      ","ÕÔ\n","ÁÖ      ","ºú      ","Öì\n"};
        check_1[1]=new String[]{"Áº      ","¹ù      ","¸ß\n","ºÎ      ","Âí      ","Ö£\n","ÂÞ      ","Î´      ","ÌÆ\n","Ð»      ","Ò¶      ","º«\n","ÈÎ      ","ÅË      ","ÓÚ\n"};
        check_1[2]=new String[]{"·ë      ","½¯      ","¶­\n","ÂÀ      ","µË      ","Ðí\n","²Ü      ","Ôø      ","Ô¬\n","Íô      ","³Ì      ","Ìï\n","Åí      ","ÖÓ      ","²Ì\n"};
        check_1[3]=new String[]{"Îº      ","Éò      ","·½\n","Â¬      ","Óà      ","¶Å\n","¶¡      ","ËÕ      ","¼Ö\n","Ò¦      ","½ª      ","Â½\n","´÷      ","¸µ      ","ÏÄ\n"};
        check_1[4]=new String[]{"ÁÎ      ","Ïô      ","Ê¯\n","½­      ","·¶      ","½ñ\n","Ì·      ","×Þ      ","´Þ\n","Ñ¦      ","Çñ      ","¿µ\n","Ê·      ","ºò      ","ÉÛ\n"};
        check_1[5]=new String[]{"ÐÜ      ","ÇØ      ","À×\n","ÃÏ      ","ÅÓ      ","°×\n","Ã«      ","ºÕ      ","Ç®\n","¶Î      ","Óá      ","ºé\n","ÌÀ      ","¹Ë      ","ºØ\n"};
        check_1[6]=new String[]{"¹¨      ","ÒÁ      ","Íò\n","Áú      ","Àµ      ","ÕÂ\n","¿×      ","Îä      ","ÐÌ\n","ÑÕ      ","Ã·      ","Èî\n","Àè      ","³£      ","Äß\n"};
        check_1[7]=new String[]{"Ê©      ","ÇÇ      ","·®\n","ÑÏ      ","Æë      ","ÌÕ\n","Ïò      ","ÎÂ      ","ÎÄ\n","Ò×      ","À¼      ","ãÆ\n","Â«      ","Å£      ","ÉÐ\n"};
        check_1[8]=new String[]{"°²      ","¹Ü      ","Òó\n","»ô      ","µÔ      ","ÙÜ\n","¸ð      ","×¯      ","Îé\n","ÐÁ      ","Á·      ","Éê\n","¸¶      ","Çú      ","½¹\n"};
        check_1[9]=new String[]{"Ïî      ","´ú      ","Â³\n","¼¾      ","ñû      ","½ð\n","±Ï      ","Âó      ","Ñô\n","¹¢      ","Êæ      ","Äô\n","Ê¢      ","Í¯      ","×£\n"};
        check_1[10]=new String[]{"Áø      ","µ¥      ","Ë®\n","ÔÀ      ","Âæ      ","¼Í\n","Å·      ","·¿      ","×ó\n","ÓÈ      ","Áè      ","Î¤\n","¾°      ","Õ²      ","Äª\n"};
        check_1[11]=new String[]{"ÀÉ      ","Â·      ","Äþ\n","·ï      ","¹Ø      ","´Ô\n","ÎÌ      ","ÈÝ      ","¿º\n","éð      ","±«      ","ÆÑ\n","Ãç      ","Ä²      ","¹È\n"};
        check_1[12]=new String[]{"Åá      ","ÉÌ      ","³õ\n","Çü      ","³É      ","°ü\n","ÓÎ      ","Ë¾      ","Æî\n","Ç¿      ","½ù      ","¸Ê\n","Ï¯      ","öÄ      ","²·\n"};
        check_1[13]=new String[]{"ñÒ      ","½â      ","ê°\n","Ê±      ","·Ñ      ","°à\n","»ª      ","È«      ","Í¿\n","×¿      ","µ³      ","ÈÄ\n","Ó¦      ","ÎÀ      ","Çð\n"};
        check_1[14]=new String[]{"Ëå      ","Ã×      ","ãÉ\n","³©      ","Ó÷      ","È½\n","¹¬      ","Õç      ","Ðû\n","ÄÂ      ","Ì¸      ","¿ï\n","Ë§      ","³µ      ","Ä¸\n"};
        check_1[15]=new String[]{"²é      ","ÆÝ      ","·û\n","¿Š      ","²ý      ","Â¦\n","ÌÙ      ","Î»      ","ÞÉ\n","±ß      ","±å      ","¹ð\n","Ú÷      ","¹¶      ","°Ø\n"};
        check_1[16]=new String[]{"¾®      ","¼½      ","Úù\n","¼ª      ","°½      ","É£\n","³Ø      ","¼ò      ","Ýþ\n","Á¬      ","°¬      ","À¶\n","ñ¼      ","¸Õ      ","·â\n"};
        check_1[17]=new String[]{"Õ¼      ","³Ù      ","¼§\n","µó      ","èï      ","Àä\n","º¼      ","Ö²      ","Óô\n","½ú      ","ÓÝ      ","Ù¡\n","Ô·      ","ÍÀ      ","²Ø\n"};
        check_1[18]=new String[]{"ÃÉ      ","¾­      ","¹¼\n","Á®      ","¹®      ","Âé\n","êÌ      ","Ïà      ","Ê¦\n","Û³      ","ãú      ","Ñà\n","á¯      ","¹Ù      ","ÖÙ\n"};
        check_1[19]=new String[]{"Ñò      ","½Ò      ","³ð\n","Û¡      ","×Ú      ","¾£\n","¸Ç      ","êÚ      ","Áº\n","Ô­      ","Ã©      ","ÈÙ\n","É³      ","Û¬      ","Î×\n"};
        check_1[20]=new String[]{"¾Ï      ","î¸      ","Î´\n","À´      ","ÀÍ      ","Öî\n","¼Æ      ","ÀÖ      ","»¬\n","Ë«      ","»¨      ","Ùþ\n","Î¾      ","Ë®      ","·á\n"};
        check_1[21]=new String[]{"¿Ü      ","Àõ      ","¿ö\n","¸É      ","Â¥      ","Âú\n","Ûg      ","Õ¿      ","ÚÈ\n","´¢      ","°î      ","Æ¤\n","³þ      ","ñã      ","Ã÷\n"};
        check_1[22]=new String[]{"Æ½      ","ÌÚ      ","À÷\n","Øë      ","Àø      ","óÃ\n","ÎÅ      ","Óî      ","Ö§\n","¶¼      ","ÕÛ      ","¿õ\n","ÄÏ      ","Õ½      ","»ü\n"};
        check_1[23]=new String[]{"»¯      ","ÃÓ      ","ÒÂ\n","¹ú      ","·ê      ","ÃÅ\n","³ç      ","ôÃ      ","±¡\n","Êø      ","ËÞ      ","¶«\n","½µ      ","åÖ      ","ÒÁ\n"};

        check_2[0]=new String[]{"Íõ    ","Áº    ","·ë    ","Îº\n","ÁÎ    ","ÐÜ    ","¹¨    ","Ê©\n","°²    ","Ïî    ","Áø    ","ÀÉ\n","Åá    ","ñÒ    ","Ëå    ","²é\n","¾®    ","Õ¼    ","ÃÉ    ","Ñò\n","¾Ï    ","¿Ü    ","Æ½    ","»¯\n"};
        check_2[1]=new String[]{"Àî    ","¹ù    ","½¯    ","Éò\n","Ïô    ","ÇØ    ","ÒÁ    ","ÇÇ\n","¹Ü    ","´ú    ","µ¥    ","Â·\n","ÉÌ    ","½â    ","Ã×    ","ÆÝ\n","¼½    ","³Ù    ","¾­    ","½Ò\n","î¸    ","Àõ    ","ÌÚ    ","ÃÓ\n"};
        check_2[2]=new String[]{"ÕÅ    ","¸ß    ","¶­    ","·½\n","Ê¯    ","À×    ","Íò    ","·®\n","Òó    ","Â³    ","Ë®    ","Äþ\n","³ý    ","ê°    ","ãÉ    ","·û\n","Úù    ","¼§    ","¹¼    ","³ð\n","Î´    ","¿ö    ","À÷    ","ÒÂ\n"};
        check_2[3]=new String[]{"Áõ    ","ºÎ    ","ÂÀ    ","Â¬\n","½­    ","ÃÏ    ","Áú    ","ÑÏ\n","»ô    ","¼¾    ","ÔÀ    ","·ï\n","Çü    ","Ê±    ","³©    ","¿Š\n","¼ª    ","µó    ","Á®    ","Û¡\n","À´    ","¸É    ","Øë    ","¹ú\n"};
        check_2[4]=new String[]{"³Â    ","Âí    ","µË    ","Óà\n","·¶    ","ÅÓ    ","Àµ    ","Æë\n","µÔ    ","ñû    ","Âæ    ","¹Ø\n","³É    ","·Ñ    ","Ó÷    ","²ý\n","°½    ","èï    ","¹®    ","×Ú\n","ÀÍ    ","Â¥    ","Àø    ","·ê\n"};
        check_2[5]=new String[]{"Ñî    ","Ö£    ","Ðí    ","¶Å\n","½ñ    ","°×    ","ÕÂ    ","ÌÕ\n","ÙÜ    ","½ð    ","¼Í    ","´Ô\n","°ü    ","°à    ","È½    ","Â¦\n","É£    ","Àä    ","Âé    ","¾£\n","Öî    ","Âú    ","óÃ    ","ÃÅ\n"};
        check_2[6]=new String[]{"ÖÜ    ","ÂÞ    ","²Ü    ","¶¡\n","Ì·    ","Ã«    ","¿×    ","Ïò\n","¸ð    ","±Ï    ","Å·    ","ÎÌ\n","ÓÎ    ","»ª    ","¹¬    ","ÌÙ\n","³Ø    ","º¼    ","êÌ    ","¸Ç\n","¼Æ    ","¾Ï    ","ÎÅ    ","³ç\n"};
        check_2[7]=new String[]{"»Æ    ","Î´    ","Ôø    ","ËÕ\n","×Þ    ","ºÕ    ","Îä    ","ÎÂ\n","×¯    ","Âó    ","·¿    ","ÈÝ\n","Ë¾    ","È«    ","Õç    ","Î»\n","¼ò    ","Ö²    ","Ïà    ","êÚ\n","ÀÖ    ","Õ¿    ","Óî    ","ôÃ\n"};
        check_2[8]=new String[]{"Ëï    ","ÌÆ    ","Ô¬    ","¼Ö\n","´Þ    ","Ç®    ","ÐÌ    ","ÎÄ\n","Îé    ","Ñô    ","×ó    ","¿º\n","Æî    ","Í¿    ","Ðû    ","ÞÉ\n","Ýþ    ","Óô    ","Ê¦    ","Áº\n","»¬    ","Õ¿    ","Ö§    ","±¡\n"};
        check_2[9]=new String[]{"Îâ    ","Ð»    ","Íô    ","Ò¦\n","Ñ¦    ","¶Î    ","ÑÕ    ","Ò×\n","ÐÁ    ","¹¢    ","ÓÈ    ","¿Â\n","Ç¿    ","×¿    ","ÄÂ    ","±ß\n","Á¬    ","½ú    ","Û³    ","Ô­\n","Ë«    ","´¢    ","¶¼    ","¶«\n"};
        check_2[10]=new String[]{"Ðì    ","Ò¶    ","³Ì    ","½ª\n","Çñ    ","Óá    ","Ã·    ","À¼\n","Á·    ","Êæ    ","Áè    ","±«\n","½ù    ","µ³    ","Ì¸    ","±å\n","°¬    ","ÓÝ    ","ãú    ","Ã©\n","»¨    ","°î    ","ÕÛ    ","ËÞ\n"};
        check_2[11]=new String[]{"ÕÔ    ","º«    ","Ìï    ","Â½\n","¿µ    ","ºé    ","Èî    ","ãÆ\n","Éê    ","Äô    ","Î¤    ","ÆÖ\n","¸Ê    ","ÈÄ    ","¿ï    ","¹ð\n","À¶    ","Ù¡    ","Ñà    ","Üþ\n","Ùþ    ","Æ¤    ","¿õ    ","¶«\n"};
        check_2[12]=new String[]{"ÁÖ    ","ÈÎ    ","Åí    ","´÷\n","Ê·    ","ÌÀ    ","Àè    ","Â«\n","¸¶    ","Ê¢    ","¾°    ","Ãç\n","Ï¯    ","Ó¦    ","Ë§    ","Ú÷\n","ñ¼    ","Ô·    ","á¯    ","É³\n","Î¾    ","³þ    ","ÄÏ    ","½µ\n"};
        check_2[13]=new String[]{"ºú    ","ÅË    ","ÖÓ    ","¸µ\n","ÏÀ    ","¹Ë    ","³£    ","Å£\n","Çú    ","Í¯    ","Õ²    ","Ä²\n","öÄ    ","ÎÀ    ","³µ    ","¹¶\n","¸Õ    ","ÍÀ    ","¹Ù    ","Û¬\n","Ë®    ","ñã    ","Õ½    ","åÖ\n"};
        check_2[14]=new String[]{"Öì    ","ÓÚ    ","²Ì    ","ÏÄ\n","ÉÛ    ","ºØ    ","Äß    ","ÉÐ\n","½¹    ","×£    ","Äª    ","¹È\n","²·    ","Çð    ","Ä¸    ","°Ø\n","·â    ","²Ø    ","ÖÙ    ","Î×\n","·á    ","Ã÷    ","ïú    ","ÒÁ\n"};
        for(int i=0;i<24;i++){
            int n = JOptionPane.showConfirmDialog(null, "You Last Name In Here ?\n" +check_1[i][0]+check_1[i][1]+check_1[i][2]+check_1[i][3]+check_1[i][4]+check_1[i][5]+check_1[i][6]+check_1[i][7]+check_1[i][8]+check_1[i][9]+check_1[i][10]+check_1[i][11]+check_1[i][12]+check_1[i][13]+check_1[i][14]);
            if (n == 0) {
                sign[0] = i;
                break;
            }
            else if(n==2){
                break;
            }
        }
        if(sign[0]==-1){
            JOptionPane.showMessageDialog(null,"Sorry,Unable To Detect Your Last Name!");
            return;
        }
        for(int i=0;i<15;i++){
            int n=JOptionPane.showConfirmDialog(null,"You Name In Here ?\n"+check_2[i][0]+check_2[i][1]+check_2[i][2]+check_2[i][3]+check_2[i][4]+check_2[i][5]+check_2[i][6]+check_2[i][7]+check_2[i][8]+check_2[i][9]+check_2[i][10]+check_2[i][11]+check_2[i][12]+check_2[i][13]+check_2[i][14]+check_2[i][15]+check_2[i][16]+check_2[i][17]+check_2[i][18]+check_2[i][19]+check_2[i][20]+check_2[i][21]+check_2[i][22]+check_2[i][23]);
            if(n==0){
                sign[1]=i;
                break;
            }else if(n==2){
                break;
            }
        }
        JOptionPane.showMessageDialog(null,"You Last Name Is :"+check_2[sign[1]][sign[0]]);
    }
}
